sdaiFindInstanceRolesOf(Sdai_instS*,Sdai_Id_aggr*,Sdai_Id_aggr*)
\details
Retrieves the identifiers of the attributes of entity instances referencing
the specified entity instance.
\param instance [in] Identifier of the entity instance whose roles are requested.
\param domain [in] Identifier of a NPL containing the SdaiSchemaInstance identifiers of the
schema instances that define the domain of the function request.
\param resultList [in/out]  Identifier of the pre-existing NPL to which SdaiAttr identifiers of the
entity instances that reference the specified entity instance are appended.
\returns Identifier of the result NPL.